blog-posts/2004-06-02-much-productive-hacking-last-night.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Much productive hacking last night</title>
<!-- 2015-10-19 Mon 14:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Much productive hacking last night</h1>
<p>
June 2nd, 2004 -
<a href="http://sachachua.com/blog/p/2089"><a href="http://sachachua.com/blog/p/2089">http://sachachua.com/blog/p/2089</a></a>
</p>

<ul class="org-ul">
<li>Dusted off
</li>
</ul>
<p>
<a href="http://sachachua.com/notebook/wiki/CoursesSubmission">CoursesSubmission</a>
and started hacking on it again: minor
</p>

<blockquote>
<p>
template tweaks (tables instead of lists, for example) and some code
 refactoring into objects.
</p>
</blockquote>

<ul class="org-ul">
<li>Almost done with
</li>
</ul>
<p>
<a href="http://sachachua.com/notebook/wiki/JavaCd">JavaCd</a>. Just need to
download Eclipse RC1 and
</p>

<blockquote>
<p>
update the installation instructions, then we'll be all set. I don't
 think I'll be able to put my material on the CD, but at least I've
 included the PPT slides from the aegis website as well as the
 excellent
<a href="http://chortle.ccsu.ctstateu.edu/cs151/cs151java.html">chortle
tutorial</a>.
</p>
</blockquote>

<ul class="org-ul">
<li>Sent Ching a formal thank-you note for the lunch with Som Mittal.
</li>

<li>Upgraded my kernel to 2.6.6.
</li>

<li>Started work on
</li>
</ul>
<p>
<a href="http://sachachua.com/notebook/wiki/PlannerDatabase">PlannerDatabase</a>,
which will get around the problem
</p>

<blockquote>
<p>
of having tasks in different places. Should probably consider
 working with one of the real database packages like EDB, but will
 have fun coding it anyway. Actually have a test-suite with decent
 coverage.
</p>
</blockquote>

<ul class="org-ul">
<li>Have also figured out how to use testcover.el. Am pleasantly
</li>
</ul>

<blockquote>
<p>
surprised to find out that it's actually in main Emacs, so will
 remove it from my <a href="http://sachachua.com/notebook/emacs">../emacs</a>
directory. Have not yet figured out
 how to properly use 1value, but that's okay.
</p>
</blockquote>

<ul class="org-ul">
<li>Am changing the way I use planner. Have realized that I don't
</li>
</ul>

<blockquote>
<p>
actually need planner-align-tasks, planner-renumber-tasks and
 planner-renumber-notes in my write-file-functions, and will probably
 remove those from the default.
</p>
</blockquote>

<ul class="org-ul">
<li>Used Gnus to pull data out of old Eudora mailboxes. Whee! My mom
</li>
</ul>

<blockquote>
<p>
needed to find mail related to her business trip to Malaysia. The
 semi-fuzzy search was fun.
</p>
</blockquote>

<ul class="org-ul">
<li>Found my apartment keys. Yay!
</li>
</ul>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
